title: Brute Force
description: Detects when an intruder is attempting to brute force an account
status: experimental
author: Regan Johnson
logsource:
  product: windows
  service: security
detection:
  keywords:
  keywords2:
  selection:
    EventID:
      - 4625
  condition: selection or (keywords1 AND keywords2)
level: low
tags:
resources:
