title: Brute Force
description: Detects when an adversary is attempting to gain access to a user's account throug h brute force hacking
status: experimental
author: Regan Johnson
logsource:
  product: windows
  service: security
detection:
  keywords:
    - Hydra
    - BruteForcer
  selection:
    EventID:
      - 4625
      - 4771
      - 4648
  condition: selection 
level: low
tags:
  - attack.t1110
resources:
      - https://attack.mitre.org/techniques/T1110/
      - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
      - https://capec.mitre.org/data/definitions/112.html
