title: Scheduled Task Creation
description: Alerts when a scheduled task is created, deleted, enabled, disabled, or updated, matching certain keywords noted to be indicators of compromise.
status: experimental
author: Matthew Traino
# reviewed by kvolakos
# reviewed by wjames
logsource:
  product: windows
  service: taskscheduler
detection:
  keywords:
    # - fin7 for event id 4698
    - byzNne17.exe
    - c9FGG17.exe
    - zEsb17.exe
    - test.exe # APT3 downloader creates persistence by creating a scheduled task called test.exe for event id 4698
    - at.exe # creation of scheduled tasks on a windows machine not running windows 10
    - schtasks.exe # creation of scheduled tasks on a windows machine running windows 10
  selection:
    EventID:
      - 4698
      - 4699
      - 4700
      - 4701
      - 4702
  condition: selection AND keywords
level: low
tags:
  - attack.t1053
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698
  - https://docs.microsoft.com/en-us/windows/win32/taskschd/task-scheduler-schema?redirectedfrom=MSDN
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
  - https://attack.mitre.org/groups/G0022/
  - https://securelist.com/fin7-5-the-infamous-cybercrime-rig-fin7-continues-its-activities/90703/
