title: New Service Creation
description: Detects when detects are created.
status: experimental
author: Brian Mills
logsource:
  product: windows
  service:
detection:
  keywords:
    - System.Management.Automation.dll
  keywords2:
  selection:
    EventID:
      - 7045
      - 4697
  condition: selection or (keywords1 AND keywords2)
level: low
tags:
resources: https://attack.mitre.org/techniques/T1050/
