title: New Service Creation detection
description: Detects when services are created and looks for powershell usage. Requires loging of Windows Management Instrumentation and service installment history.
status: experimental
author: Brian Mills
# reviewed by kvolakos
# reviewed by mtraino
logsource:
  product: windows
  service: Windows Services
detection:
  keywords:
    - System.Management.Automation.dll
    - Nwsapagent #Ke3chang/APT15 backdoor RoyalDNS established persistence
  selection:
    EventID:
      - 7045
      - 4697
  condition: selection OR keywords
level: low
tags:
  - attack.t1050
resources:
  -https://attack.mitre.org/techniques/T1050/
  -https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/wp-windows-management-instrumentation.pdf
  -https://attack.mitre.org/techniques/T1047/
  -https://attack.mitre.org/techniques/T1086/
  -https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
  -https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc772408(v=ws.11)?redirectedfrom=MSDN
