title: New Service Creation
description: Detects when detects are created.
status: experimental
author: Brian Mills
logsource:
  product: windows
  service:
detection:
  keywords:
    - test.exe
    - Watchmon Service
  keywords2:
  selection:
    EventID:
      - 7045
      - 4697
  condition: selection or (keywords1 AND keywords2)
level: low
tags:
